#include <iostream>
int main()
{
	char* p = new char[50];

	//char** q = &p;
	//*q = "hehe";

	//p = "hehe";
	delete[] p;

    /*

	//////////////////////////////////////////////////////////////////
	int k = 20;
	int* m = new int[50];
	//*(m + 1) = k;
	//*m = 30;
	m = &k; // 这里虽然编译通过了，但是实际上是把一个整形对象的地址赋值给了一个整型数组的地址，
            // 这样做好像是不可以的， 有可能改变了m的类型。
	//for (int i = 0; i < 5; i++)
	//{
	//	std::cout << *(m+i) << std::endl;
	//}
	delete[] m;
	///////////////////////////////////////////////////////////////////
    */
    std::cin.get();
	return 0;
}
