//#pragma once




#include <malloc.h>



/******************************************************************************************/
// new函数的定义
/******************************************************************************************/

#define _NEW_(class_name)								\
class_name * new_##class_name() {						\
    class_name * obj = NULL;							\
	obj = (class_name *)malloc( sizeof(class_name) );	\
    if( !obj )											\
        obj = NULL;									    \
	else												\
		ctor_##class_name(obj);							\
    return obj;											\
}

/******************************************************************************************/
// delete函数的定义
/******************************************************************************************/

#define _DELETE_(class_name)							\
void delete_##class_name(class_name * obj) {			\
	dtor_##class_name( obj );							\
	if ( obj ) {										\
		free(obj);										\
		obj = NULL;									    \
	}													\
}


/******************************************************************************************/
// 构造函数的定义
/******************************************************************************************/
#define _CTOR_(class_name)	_NEW_(class_name)			\
void ctor_##class_name(class_name * obj){               \
obj->instance_ = _instance;


/******************************************************************************************/
// 绑定类与函数指针
/******************************************************************************************/
#define _BIND_FUNC_(func_, func) obj->func_ = &(func);

#define _END_CTOR_	}


/******************************************************************************************/
// 析构函数的定义
/******************************************************************************************/
#define _DTOR_(class_name) _DELETE_(class_name)			\
void dtor_##class_name(class_name * obj){               \
obj->instance_ = _callback;

#define _END_DTOR_	}
