#pragma once




/******************************************************************************************/
// 重定义数据类型
// 数据类型均为小写
/******************************************************************************************/
typedef unsigned char	u_char;
typedef unsigned long	u_long;
typedef unsigned short	u_short;
//typedef uchar			boolean;




/******************************************************************************************/
//定义公共复合数据类型
//复合数据类型命名规则 -> 单词大写 + “_”分隔
//成员变量命名规则     -> 单词小 + “_”分隔，以“_”结尾
/******************************************************************************************/

//结果对象
typedef struct __tag_RESULT
{
	_ERROR		error_;
	_BOOLEAN	result_;

#ifdef _DEBUG_DEPICT_//测试返回值
	u_char		file_[ _L_256 ];
	u_long      line_;
#endif//_DEBUG_DEPICT_
}
RESULT;
